app/controllers/accounts_controller.rb

	def index

		@user = current_user
		@client_token = Braintree::ClientToken.generate
		@mentors = User.where("users.merchant_account_id IS NOT NULL")
---
SELECT "users".* FROM "users" WHERE (users.merchant_account_id IS NOT NULL)