app/controllers/transactions_controller.rb

	def index
		@transactions = Transaction.where(user_id: current_user.id)
		@mentor_first_name = []
		@mentor_last_name = []
		@transactions.each do |t| # try map
			user = User.find(t.pay_to_mentor_id)
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = ?  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]